espressif/esp-idf/components/soc/esp32p4/include/soc/lp_analog_peri_struct.h
/** Type of touch_filter2 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:15;
        /** touch_outen : R/W; bitpos: [29:15]; default: 16383;
         *  need_des
         */
        uint32_t touch_outen:15;
        /** touch_bypass_noise_thres : R/W; bitpos: [30]; default: 0;
         *  need_des
         */
        uint32_t touch_bypass_noise_thres:1;
        /** touch_bypass_neg_noise_thres : R/W; bitpos: [31]; default: 0;
         *  need_des
         */
        uint32_t touch_bypass_neg_noise_thres:1;
    };
    uint32_t val;
} lp_ana_touch_filter2_reg_t;

/** Type of touch_filter3 register
 *  need_des
 */
typedef union {
    struct {
        /** touch_baseline_sw : R/W; bitpos: [15:0]; default: 0;
         *  need_des
         */
        uint32_t touch_baseline_sw:16;
        /** touch_update_baseline_sw : WT; bitpos: [16]; default: 0;
         *  need_des
         */
        uint32_t touch_update_baseline_sw:1;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} lp_ana_touch_filter3_reg_t;

/** Type of touch_slp0 register
 *  need_des
 */
typedef union {
    struct {
        /** touch_slp_th0 : R/W; bitpos: [15:0]; default: 0;
         *  need_des
         */
        uint32_t touch_slp_th0:16;
        /** touch_slp_channel_clr : WT; bitpos: [16]; default: 0;
         *  need_des
         */
        uint32_t touch_slp_channel_clr:1;
        /** touch_slp_pad : R/W; bitpos: [20:17]; default: 15;
         *  need_des
         */
        uint32_t touch_slp_pad:4;
        uint32_t reserved_21:11;
    };
    uint32_t val;
} lp_ana_touch_slp0_reg_t;

/** Type of touch_slp1 register
 *  need_des
 */
typedef union {
    struct {
        /** touch_slp_th2 : R/W; bitpos: [15:0]; default: 0;
         *  need_des
         */
        uint32_t touch_slp_th2:16;
        /** touch_slp_th1 : R/W; bitpos: [31:16]; default: 0;
         *  need_des
         */
        uint32_t touch_slp_th1:16;
    };
    uint32_t val;
} lp_ana_touch_slp1_reg_t;

/** Type of touch_clr register
 *  need_des
 */
typedef union {
    struct {
        /** touch_channel_clr : WT; bitpos: [14:0]; default: 0;
         *  need_des
         */
        uint32_t touch_channel_clr:15;
        /** touch_status_clr : WT; bitpos: [15]; default: 0;
         *  need_des
         */
        uint32_t touch_status_clr:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} lp_ana_touch_clr_reg_t;

/** Type of touch_approach register
 *  need_des
 */
typedef union {
    struct {
        /** touch_approach_pad0 : R/W; bitpos: [3:0]; default: 15;
         *  need_des
         */
        uint32_t touch_approach_pad0:4;
        /** touch_approach_pad1 : R/W; bitpos: [7:4]; default: 15;
         *  need_des
         */
        uint32_t touch_approach_pad1:4;
        /** touch_approach_pad2 : R/W; bitpos: [11:8]; default: 15;
         *  need_des
         */
        uint32_t touch_approach_pad2:4;
        /** touch_slp_approach_en : R/W; bitpos: [12]; default: 0;
         *  need_des
         */
        uint32_t touch_slp_approach_en:1;
        uint32_t reserved_13:19;
    };
    uint32_t val;
} lp_ana_touch_approach_reg_t;

/** Type of touch_freq0_scan_para register
 *  need_des
 */
typedef union {
    struct {
        /** touch_freq0_dcap_lpf : R/W; bitpos: [6:0]; default: 0;
         *  need_des
         */
        uint32_t touch_freq0_dcap_lpf:7;
        /** touch_freq0_dres_lpf : R/W; bitpos: [8:7]; default: 0;
         *  need_des
         */
        uint32_t touch_freq0_dres_lpf:2;
        /** touch_freq0_drv_ls : R/W; bitpos: [12:9]; default: 0;
         *  need_des
         */
        uint32_t touch_freq0_drv_ls:4;
        /** touch_freq0_drv_hs : R/W; bitpos: [17:13]; default: 0;
         *  need_des
         */
        uint32_t touch_freq0_drv_hs:5;
        /** touch_freq0_dbias : R/W; bitpos: [22:18]; default: 0;
         *  need_des
         */
        uint32_t touch_freq0_dbias:5;
        uint32_t reserved_23:9;
    };
    uint32_t val;
} lp_ana_touch_freq0_scan_para_reg_t;

/** Type of touch_freq1_scan_para register
 *  need_des
 */
typedef union {
    struct {
        /** touch_freq1_dcap_lpf : R/W; bitpos: [6:0]; default: 0;
         *  need_des
         */
        uint32_t touch_freq1_dcap_lpf:7;
        /** touch_freq1_dres_lpf : R/W; bitpos: [8:7]; default: 0;
         *  need_des
         */
        uint32_t touch_freq1_dres_lpf:2;
        /** touch_freq1_drv_ls : R/W; bitpos: [12:9]; default: 0;
         *  need_des
         */
        uint32_t touch_freq1_drv_ls:4;
        /** touch_freq1_drv_hs : R/W; bitpos: [17:13]; default: 0;
         *  need_des
         */
        uint32_t touch_freq1_drv_hs:5;
        /** touch_freq1_dbias : R/W; bitpos: [22:18]; default: 0;
         *  need_des
         */
        uint32_t touch_freq1_dbias:5;
        uint32_t reserved_23:9;
    };
    uint32_t val;
} lp_ana_touch_freq1_scan_para_reg_t;

/** Type of touch_freq2_scan_para register
 *  need_des
 */
typedef union {
    struct {
        /** touch_freq2_dcap_lpf : R/W; bitpos: [6:0]; default: 0;
         *  need_des
         */
        uint32_t touch_freq2_dcap_lpf:7;
        /** touch_freq2_dres_lpf : R/W; bitpos: [8:7]; default: 0;
         *  need_des
         */
        uint32_t touch_freq2_dres_lpf:2;
        /** touch_freq2_drv_ls : R/W; bitpos: [12:9]; default: 0;
         *  need_des
         */
        uint32_t touch_freq2_drv_ls:4;
        /** touch_freq2_drv_hs : R/W; bitpos: [17:13]; default: 0;
         *  need_des
         */
        uint32_t touch_freq2_drv_hs:5;
        /** touch_freq2_dbias : R/W; bitpos: [22:18]; default: 0;
         *  need_des
         */
        uint32_t touch_freq2_dbias:5;
        uint32_t reserved_23:9;
    };
    uint32_t val;
} lp_ana_touch_freq2_scan_para_reg_t;

/** Type of touch_ana_para register
 *  need_des
 */
typedef union {
    struct {
        /** touch_touch_buf_drv : R/W; bitpos: [2:0]; default: 0;
         *  need_des
         */
        uint32_t touch_touch_buf_drv:3;
        /** touch_touch_en_cal : R/W; bitpos: [3]; default: 0;
         *  need_des
         */
        uint32_t touch_touch_en_cal:1;
        /** touch_touch_dcap_cal : R/W; bitpos: [10:4]; default: 0;
         *  need_des
         */
        uint32_t touch_touch_dcap_cal:7;
        uint32_t reserved_11:21;
    };
    uint32_t val;
} lp_ana_touch_ana_para_reg_t;

/** Type of touch_mux0 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:8;
        /** touch_data_sel : R/W; bitpos: [9:8]; default: 0;
         *  need_des
         */
        uint32_t touch_data_sel:2;
        /** touch_freq_sel : R/W; bitpos: [11:10]; default: 0;
         *  need_des
         */
        uint32_t touch_freq_sel:2;
        /** touch_bufsel : R/W; bitpos: [26:12]; default: 0;
         *  need_des
         */
        uint32_t touch_bufsel:15;
        /** touch_done_en : R/W; bitpos: [27]; default: 0;
         *  need_des
         */
        uint32_t touch_done_en:1;
        /** touch_done_force : R/W; bitpos: [28]; default: 0;
         *  need_des
         */
        uint32_t touch_done_force:1;
        /** touch_fsm_en : R/W; bitpos: [29]; default: 1;
         *  need_des
         */
        uint32_t touch_fsm_en:1;
        /** touch_start_en : R/W; bitpos: [30]; default: 0;
         *  need_des
         */
        uint32_t touch_start_en:1;
        /** touch_start_force : R/W; bitpos: [31]; default: 0;
         *  need_des
         */
        uint32_t touch_start_force:1;
    };
    uint32_t val;
} lp_ana_touch_mux0_reg_t;

/** Type of touch_mux1 register
 *  need_des
 */
typedef union {
    struct {
        /** touch_start : R/W; bitpos: [14:0]; default: 0;
         *  need_des
         */
        uint32_t touch_start:15;
        /** touch_xpd : R/W; bitpos: [29:15]; default: 0;
         *  need_des
         */
        uint32_t touch_xpd:15;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} lp_ana_touch_mux1_reg_t;

/** Type of touch_pad0_th0 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:16;
        /** touch_pad0_th0 : R/W; bitpos: [31:16]; default: 0;
         *  Reserved
         */
        uint32_t touch_pad0_th0:16;
    };
    uint32_t val;
} lp_ana_touch_pad0_th0_reg_t;

/** Type of touch_pad0_th1 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:16;
        /** touch_pad0_th1 : R/W; bitpos: [31:16]; default: 0;
         *  Reserved
         */
        uint32_t touch_pad0_th1:16;
    };
    uint32_t val;
} lp_ana_touch_pad0_th1_reg_t;

/** Type of touch_pad0_th2 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:16;
        /** touch_pad0_th2 : R/W; bitpos: [31:16]; default: 0;
         *  Reserved
         */
        uint32_t touch_pad0_th2:16;
    };
    uint32_t val;
} lp_ana_touch_pad0_th2_reg_t;

/** Type of touch_pad1_th0 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:16;
        /** touch_pad1_th0 : R/W; bitpos: [31:16]; default: 0;
         *  Reserved
         */
        uint32_t touch_pad1_th0:16;
    };
    uint32_t val;
} lp_ana_touch_pad1_th0_reg_t;

/** Type of touch_pad1_th1 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:16;
        /** touch_pad1_th1 : R/W; bitpos: [31:16]; default: 0;
         *  Reserved
         */
        uint32_t touch_pad1_th1:16;
    };
    uint32_t val;
} lp_ana_touch_pad1_th1_reg_t;

