espressif/esp-idf/components/soc/esp32p4/include/soc/lp_analog_peri_struct.h
/** Type of touch_pad1_th2 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:16;
        /** touch_pad1_th2 : R/W; bitpos: [31:16]; default: 0;
         *  Reserved
         */
        uint32_t touch_pad1_th2:16;
    };
    uint32_t val;
} lp_ana_touch_pad1_th2_reg_t;

/** Type of touch_pad2_th0 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:16;
        /** touch_pad2_th0 : R/W; bitpos: [31:16]; default: 0;
         *  Reserved
         */
        uint32_t touch_pad2_th0:16;
    };
    uint32_t val;
} lp_ana_touch_pad2_th0_reg_t;

/** Type of touch_pad2_th1 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:16;
        /** touch_pad2_th1 : R/W; bitpos: [31:16]; default: 0;
         *  Reserved
         */
        uint32_t touch_pad2_th1:16;
    };
    uint32_t val;
} lp_ana_touch_pad2_th1_reg_t;

/** Type of touch_pad2_th2 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:16;
        /** touch_pad2_th2 : R/W; bitpos: [31:16]; default: 0;
         *  Reserved
         */
        uint32_t touch_pad2_th2:16;
    };
    uint32_t val;
} lp_ana_touch_pad2_th2_reg_t;

/** Type of touch_pad3_th0 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:16;
        /** touch_pad3_th0 : R/W; bitpos: [31:16]; default: 0;
         *  Reserved
         */
        uint32_t touch_pad3_th0:16;
    };
    uint32_t val;
} lp_ana_touch_pad3_th0_reg_t;

/** Type of touch_pad3_th1 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:16;
        /** touch_pad3_th1 : R/W; bitpos: [31:16]; default: 0;
         *  Reserved
         */
        uint32_t touch_pad3_th1:16;
    };
    uint32_t val;
} lp_ana_touch_pad3_th1_reg_t;

/** Type of touch_pad3_th2 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:16;
        /** touch_pad3_th2 : R/W; bitpos: [31:16]; default: 0;
         *  Reserved
         */
        uint32_t touch_pad3_th2:16;
    };
    uint32_t val;
} lp_ana_touch_pad3_th2_reg_t;

/** Type of touch_pad4_th0 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:16;
        /** touch_pad4_th0 : R/W; bitpos: [31:16]; default: 0;
         *  Reserved
         */
        uint32_t touch_pad4_th0:16;
    };
    uint32_t val;
} lp_ana_touch_pad4_th0_reg_t;

/** Type of touch_pad4_th1 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:16;
        /** touch_pad4_th1 : R/W; bitpos: [31:16]; default: 0;
         *  Reserved
         */
        uint32_t touch_pad4_th1:16;
    };
    uint32_t val;
} lp_ana_touch_pad4_th1_reg_t;

/** Type of touch_pad4_th2 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:16;
        /** touch_pad4_th2 : R/W; bitpos: [31:16]; default: 0;
         *  Reserved
         */
        uint32_t touch_pad4_th2:16;
    };
    uint32_t val;
} lp_ana_touch_pad4_th2_reg_t;

/** Type of touch_pad5_th0 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:16;
        /** touch_pad5_th0 : R/W; bitpos: [31:16]; default: 0;
         *  Reserved
         */
        uint32_t touch_pad5_th0:16;
    };
    uint32_t val;
} lp_ana_touch_pad5_th0_reg_t;

/** Type of touch_pad5_th1 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:16;
        /** touch_pad5_th1 : R/W; bitpos: [31:16]; default: 0;
         *  Reserved
         */
        uint32_t touch_pad5_th1:16;
    };
    uint32_t val;
} lp_ana_touch_pad5_th1_reg_t;

/** Type of touch_pad5_th2 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:16;
        /** touch_pad5_th2 : R/W; bitpos: [31:16]; default: 0;
         *  Reserved
         */
        uint32_t touch_pad5_th2:16;
    };
    uint32_t val;
} lp_ana_touch_pad5_th2_reg_t;

/** Type of touch_pad6_th0 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:16;
        /** touch_pad6_th0 : R/W; bitpos: [31:16]; default: 0;
         *  Reserved
         */
        uint32_t touch_pad6_th0:16;
    };
    uint32_t val;
} lp_ana_touch_pad6_th0_reg_t;

/** Type of touch_pad6_th1 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:16;
        /** touch_pad6_th1 : R/W; bitpos: [31:16]; default: 0;
         *  Reserved
         */
        uint32_t touch_pad6_th1:16;
    };
    uint32_t val;
} lp_ana_touch_pad6_th1_reg_t;

/** Type of touch_pad6_th2 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:16;
        /** touch_pad6_th2 : R/W; bitpos: [31:16]; default: 0;
         *  Reserved
         */
        uint32_t touch_pad6_th2:16;
    };
    uint32_t val;
} lp_ana_touch_pad6_th2_reg_t;

/** Type of touch_pad7_th0 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:16;
        /** touch_pad7_th0 : R/W; bitpos: [31:16]; default: 0;
         *  Reserved
         */
        uint32_t touch_pad7_th0:16;
    };
    uint32_t val;
} lp_ana_touch_pad7_th0_reg_t;

/** Type of touch_pad7_th1 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:16;
        /** touch_pad7_th1 : R/W; bitpos: [31:16]; default: 0;
         *  Reserved
         */
        uint32_t touch_pad7_th1:16;
    };
    uint32_t val;
} lp_ana_touch_pad7_th1_reg_t;

/** Type of touch_pad7_th2 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:16;
        /** touch_pad7_th2 : R/W; bitpos: [31:16]; default: 0;
         *  Reserved
         */
        uint32_t touch_pad7_th2:16;
    };
    uint32_t val;
} lp_ana_touch_pad7_th2_reg_t;

/** Type of touch_pad8_th0 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:16;
        /** touch_pad8_th0 : R/W; bitpos: [31:16]; default: 0;
         *  Reserved
         */
        uint32_t touch_pad8_th0:16;
    };
    uint32_t val;
} lp_ana_touch_pad8_th0_reg_t;

/** Type of touch_pad8_th1 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:16;
        /** touch_pad8_th1 : R/W; bitpos: [31:16]; default: 0;
         *  Reserved
         */
        uint32_t touch_pad8_th1:16;
    };
    uint32_t val;
} lp_ana_touch_pad8_th1_reg_t;

