espressif/esp-idf/components/soc/esp32p4/include/soc/lp_analog_peri_struct.h
/** Type of touch_pad8_th2 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:16;
        /** touch_pad8_th2 : R/W; bitpos: [31:16]; default: 0;
         *  Reserved
         */
        uint32_t touch_pad8_th2:16;
    };
    uint32_t val;
} lp_ana_touch_pad8_th2_reg_t;

/** Type of touch_pad9_th0 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:16;
        /** touch_pad9_th0 : R/W; bitpos: [31:16]; default: 0;
         *  Reserved
         */
        uint32_t touch_pad9_th0:16;
    };
    uint32_t val;
} lp_ana_touch_pad9_th0_reg_t;

/** Type of touch_pad9_th1 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:16;
        /** touch_pad9_th1 : R/W; bitpos: [31:16]; default: 0;
         *  Reserved
         */
        uint32_t touch_pad9_th1:16;
    };
    uint32_t val;
} lp_ana_touch_pad9_th1_reg_t;

/** Type of touch_pad9_th2 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:16;
        /** touch_pad9_th2 : R/W; bitpos: [31:16]; default: 0;
         *  Reserved
         */
        uint32_t touch_pad9_th2:16;
    };
    uint32_t val;
} lp_ana_touch_pad9_th2_reg_t;

/** Type of touch_pad10_th0 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:16;
        /** touch_pad10_th0 : R/W; bitpos: [31:16]; default: 0;
         *  Reserved
         */
        uint32_t touch_pad10_th0:16;
    };
    uint32_t val;
} lp_ana_touch_pad10_th0_reg_t;

/** Type of touch_pad10_th1 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:16;
        /** touch_pad10_th1 : R/W; bitpos: [31:16]; default: 0;
         *  Reserved
         */
        uint32_t touch_pad10_th1:16;
    };
    uint32_t val;
} lp_ana_touch_pad10_th1_reg_t;

/** Type of touch_pad10_th2 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:16;
        /** touch_pad10_th2 : R/W; bitpos: [31:16]; default: 0;
         *  Reserved
         */
        uint32_t touch_pad10_th2:16;
    };
    uint32_t val;
} lp_ana_touch_pad10_th2_reg_t;

/** Type of touch_pad11_th0 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:16;
        /** touch_pad11_th0 : R/W; bitpos: [31:16]; default: 0;
         *  Reserved
         */
        uint32_t touch_pad11_th0:16;
    };
    uint32_t val;
} lp_ana_touch_pad11_th0_reg_t;

/** Type of touch_pad11_th1 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:16;
        /** touch_pad11_th1 : R/W; bitpos: [31:16]; default: 0;
         *  Reserved
         */
        uint32_t touch_pad11_th1:16;
    };
    uint32_t val;
} lp_ana_touch_pad11_th1_reg_t;

/** Type of touch_pad11_th2 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:16;
        /** touch_pad11_th2 : R/W; bitpos: [31:16]; default: 0;
         *  Reserved
         */
        uint32_t touch_pad11_th2:16;
    };
    uint32_t val;
} lp_ana_touch_pad11_th2_reg_t;

/** Type of touch_pad12_th0 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:16;
        /** touch_pad12_th0 : R/W; bitpos: [31:16]; default: 0;
         *  Reserved
         */
        uint32_t touch_pad12_th0:16;
    };
    uint32_t val;
} lp_ana_touch_pad12_th0_reg_t;

/** Type of touch_pad12_th1 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:16;
        /** touch_pad12_th1 : R/W; bitpos: [31:16]; default: 0;
         *  Reserved
         */
        uint32_t touch_pad12_th1:16;
    };
    uint32_t val;
} lp_ana_touch_pad12_th1_reg_t;

/** Type of touch_pad12_th2 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:16;
        /** touch_pad12_th2 : R/W; bitpos: [31:16]; default: 0;
         *  Reserved
         */
        uint32_t touch_pad12_th2:16;
    };
    uint32_t val;
} lp_ana_touch_pad12_th2_reg_t;

/** Type of touch_pad13_th0 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:16;
        /** touch_pad13_th0 : R/W; bitpos: [31:16]; default: 0;
         *  Reserved
         */
        uint32_t touch_pad13_th0:16;
    };
    uint32_t val;
} lp_ana_touch_pad13_th0_reg_t;

/** Type of touch_pad13_th1 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:16;
        /** touch_pad13_th1 : R/W; bitpos: [31:16]; default: 0;
         *  Reserved
         */
        uint32_t touch_pad13_th1:16;
    };
    uint32_t val;
} lp_ana_touch_pad13_th1_reg_t;

/** Type of touch_pad13_th2 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:16;
        /** touch_pad13_th2 : R/W; bitpos: [31:16]; default: 0;
         *  Reserved
         */
        uint32_t touch_pad13_th2:16;
    };
    uint32_t val;
} lp_ana_touch_pad13_th2_reg_t;

/** Type of touch_pad14_th0 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:16;
        /** touch_pad14_th0 : R/W; bitpos: [31:16]; default: 0;
         *  Reserved
         */
        uint32_t touch_pad14_th0:16;
    };
    uint32_t val;
} lp_ana_touch_pad14_th0_reg_t;

/** Type of touch_pad14_th1 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:16;
        /** touch_pad14_th1 : R/W; bitpos: [31:16]; default: 0;
         *  Reserved
         */
        uint32_t touch_pad14_th1:16;
    };
    uint32_t val;
} lp_ana_touch_pad14_th1_reg_t;

/** Type of touch_pad14_th2 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:16;
        /** touch_pad14_th2 : R/W; bitpos: [31:16]; default: 0;
         *  Reserved
         */
        uint32_t touch_pad14_th2:16;
    };
    uint32_t val;
} lp_ana_touch_pad14_th2_reg_t;

/** Type of date register
 *  need_des
 */
typedef union {
    struct {
        /** lp_ana_date : R/W; bitpos: [30:0]; default: 2294816;
         *  need_des
         */
        uint32_t lp_ana_date:31;
        /** clk_en : R/W; bitpos: [31]; default: 0;
         *  need_des
         */
        uint32_t clk_en:1;
    };
    uint32_t val;
} lp_ana_date_reg_t;


