espressif/esp-idf/components/soc/esp32p4/include/soc/lp_analog_peri_struct.h
typedef struct {
    volatile lp_ana_bod_mode0_cntl_reg_t bod_mode0_cntl;
    volatile lp_ana_bod_mode1_cntl_reg_t bod_mode1_cntl;
    volatile lp_ana_vdd_source_cntl_reg_t vdd_source_cntl;
    volatile lp_ana_vddbat_bod_cntl_reg_t vddbat_bod_cntl;
    volatile lp_ana_vddbat_charge_cntl_reg_t vddbat_charge_cntl;
    volatile lp_ana_ck_glitch_cntl_reg_t ck_glitch_cntl;
    volatile lp_ana_pg_glitch_cntl_reg_t pg_glitch_cntl;
    volatile lp_ana_fib_enable_reg_t fib_enable;
    volatile lp_ana_int_raw_reg_t int_raw;
    volatile lp_ana_int_st_reg_t int_st;
    volatile lp_ana_int_ena_reg_t int_ena;
    volatile lp_ana_int_clr_reg_t int_clr;
    volatile lp_ana_lp_int_raw_reg_t lp_int_raw;
    volatile lp_ana_lp_int_st_reg_t lp_int_st;
    volatile lp_ana_lp_int_ena_reg_t lp_int_ena;
    volatile lp_ana_lp_int_clr_reg_t lp_int_clr;
    uint32_t reserved_040[47];
    volatile lp_ana_touch_approach_work_meas_num_reg_t touch_approach_work_meas_num;
    volatile lp_ana_touch_scan_ctrl1_reg_t touch_scan_ctrl1;
    volatile lp_ana_touch_scan_ctrl2_reg_t touch_scan_ctrl2;
    volatile lp_ana_touch_work_reg_t touch_work;
    volatile lp_ana_touch_work_meas_num_reg_t touch_work_meas_num;
    volatile lp_ana_touch_filter1_reg_t touch_filter1;
    volatile lp_ana_touch_filter2_reg_t touch_filter2;
    volatile lp_ana_touch_filter3_reg_t touch_filter3;
    volatile lp_ana_touch_slp0_reg_t touch_slp0;
    volatile lp_ana_touch_slp1_reg_t touch_slp1;
    volatile lp_ana_touch_clr_reg_t touch_clr;
    volatile lp_ana_touch_approach_reg_t touch_approach;
    volatile lp_ana_touch_freq0_scan_para_reg_t touch_freq0_scan_para;
    volatile lp_ana_touch_freq1_scan_para_reg_t touch_freq1_scan_para;
    volatile lp_ana_touch_freq2_scan_para_reg_t touch_freq2_scan_para;
    volatile lp_ana_touch_ana_para_reg_t touch_ana_para;
    volatile lp_ana_touch_mux0_reg_t touch_mux0;
    volatile lp_ana_touch_mux1_reg_t touch_mux1;
    volatile lp_ana_touch_pad0_th0_reg_t touch_pad0_th0;
    volatile lp_ana_touch_pad0_th1_reg_t touch_pad0_th1;
    volatile lp_ana_touch_pad0_th2_reg_t touch_pad0_th2;
    volatile lp_ana_touch_pad1_th0_reg_t touch_pad1_th0;
    volatile lp_ana_touch_pad1_th1_reg_t touch_pad1_th1;
    volatile lp_ana_touch_pad1_th2_reg_t touch_pad1_th2;
    volatile lp_ana_touch_pad2_th0_reg_t touch_pad2_th0;
    volatile lp_ana_touch_pad2_th1_reg_t touch_pad2_th1;
    volatile lp_ana_touch_pad2_th2_reg_t touch_pad2_th2;
    volatile lp_ana_touch_pad3_th0_reg_t touch_pad3_th0;
    volatile lp_ana_touch_pad3_th1_reg_t touch_pad3_th1;
    volatile lp_ana_touch_pad3_th2_reg_t touch_pad3_th2;
    volatile lp_ana_touch_pad4_th0_reg_t touch_pad4_th0;
    volatile lp_ana_touch_pad4_th1_reg_t touch_pad4_th1;
    volatile lp_ana_touch_pad4_th2_reg_t touch_pad4_th2;
    volatile lp_ana_touch_pad5_th0_reg_t touch_pad5_th0;
    volatile lp_ana_touch_pad5_th1_reg_t touch_pad5_th1;
    volatile lp_ana_touch_pad5_th2_reg_t touch_pad5_th2;
    volatile lp_ana_touch_pad6_th0_reg_t touch_pad6_th0;
    volatile lp_ana_touch_pad6_th1_reg_t touch_pad6_th1;
    volatile lp_ana_touch_pad6_th2_reg_t touch_pad6_th2;
    volatile lp_ana_touch_pad7_th0_reg_t touch_pad7_th0;
    volatile lp_ana_touch_pad7_th1_reg_t touch_pad7_th1;
    volatile lp_ana_touch_pad7_th2_reg_t touch_pad7_th2;
    volatile lp_ana_touch_pad8_th0_reg_t touch_pad8_th0;
    volatile lp_ana_touch_pad8_th1_reg_t touch_pad8_th1;
    volatile lp_ana_touch_pad8_th2_reg_t touch_pad8_th2;
    volatile lp_ana_touch_pad9_th0_reg_t touch_pad9_th0;
    volatile lp_ana_touch_pad9_th1_reg_t touch_pad9_th1;
    volatile lp_ana_touch_pad9_th2_reg_t touch_pad9_th2;
    volatile lp_ana_touch_pad10_th0_reg_t touch_pad10_th0;
    volatile lp_ana_touch_pad10_th1_reg_t touch_pad10_th1;
    volatile lp_ana_touch_pad10_th2_reg_t touch_pad10_th2;
    volatile lp_ana_touch_pad11_th0_reg_t touch_pad11_th0;
    volatile lp_ana_touch_pad11_th1_reg_t touch_pad11_th1;
    volatile lp_ana_touch_pad11_th2_reg_t touch_pad11_th2;
    volatile lp_ana_touch_pad12_th0_reg_t touch_pad12_th0;
    volatile lp_ana_touch_pad12_th1_reg_t touch_pad12_th1;
    volatile lp_ana_touch_pad12_th2_reg_t touch_pad12_th2;
    volatile lp_ana_touch_pad13_th0_reg_t touch_pad13_th0;
    volatile lp_ana_touch_pad13_th1_reg_t touch_pad13_th1;
    volatile lp_ana_touch_pad13_th2_reg_t touch_pad13_th2;
    volatile lp_ana_touch_pad14_th0_reg_t touch_pad14_th0;
    volatile lp_ana_touch_pad14_th1_reg_t touch_pad14_th1;
    volatile lp_ana_touch_pad14_th2_reg_t touch_pad14_th2;
    uint32_t reserved_1f8[129];
    volatile lp_ana_date_reg_t date;
} lp_ana_dev_t;


#ifndef __cplusplus
_Static_assert(sizeof(lp_ana_dev_t) == 0x400, "Invalid size of lp_ana_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
